Repository: ow9t/lendix
Catalog: lib/src/localization/app_*.arb
Languages: de

source: all
de: alle

# categoriesEmptyList
source: No categories
de: Keine Kategorien

# categoriesTitle
source: Categories
de: Kategorien

# categoryNone
source: None
de: Keine

# categoryTitleEdit
source: Edit category
de: Kategorie bearbeiten

# categoryTitleNew
source: New category
de: Neue Kategorie

source: clear
de: leeren

source: clear all
de: alle leeren

source: clear filters
de: Filter leeren

source: delete
de: löschen

# errorCategoryExists
source: Category already exists.
de: Kategorie existiert bereits.

# errorItemWithCategoryExists
source: Item with this category already exists.
de: Gegenstand mit dieser Kategorie existiert bereits.

# errorLendingWithDataExistsLong
source: Lending with this combination of item (with category), person, and date already exists.
de: Ausleihe mit dieser Kombination aus Gegenstand (mit Kategorie), Person und Datum existiert bereits.

# errorLendingWithDataExistsShort
source: Combination of item, person, and date already exists.
de: Kombination aus Gegenstand, Person und Datum existiert bereits.

# errorDeleteUndoFailure
source: Could not undo deletion.
de: Löschen konnte nicht rückgängig gemacht werden.

# errorReturnUndoFailure
source: Could not undo returning.
de: Rückgabe konnte nicht rückgängig gemacht werden.

# errorEmptyItem
source: Please select an item.
de: Bitte wähle einen Gegenstand aus.

# errorEmptyName
source: Please enter a name.
de: Bitte gib einen Namen ein.

# errorEmptyPerson
source: Please select a person.
de: Bitte wähle eine Person aus.

# errorPersonExists
source: Person already exists.
de: Person existiert bereits.

# filterByBorrowed
source: Filter by type
de: Nach Typ filtern

source: Filter by category
de: Nach Kategorie filtern

source: Filter by person
de: Nach Person filtern

source: Filter by status
de: Nach Zustand filtern

# helperTextRequired
source: required
de: erforderlich

# itemTitleEdit
source: Edit item
de: Gegenstand bearbeiten

# itemTitleNew
source: New item
de: Neuer Gegenstand

# itemsEmptyList
source: No items
de: Keine Gegenstände

# itemsEmptyListFiltered
source: No items for these filters
de: Keine Gegenstände für diese Filter

# itemsTitle
source: Items
de: Gegenstände

# labelCategory
source: Category
de: Kategorie

# labelDate
source: Lending date
de: Ausleihdatum

# labelItem
source: Item
de: Gegenstand

# labelReturnDate
source: Return date
de: Rückgabedatum

# lendingBorrowed
source: borrowed
de: geliehen

# lendingBorrowedFrom
source: borrowed from
de: geliehen von

# lendingLent
source: lent
de: verliehen

# lendingLentTo
source: lent to
de: verliehen an

# lendingNotReturned
source: not returned
de: nicht zurückgegeben

# lendingReturned
source: returned
de: zurückgegeben

# lendingReturnedTimeAgo
source: returned {when}
de: {when} zurückgegeben

# lendingSwitchSubtitle
source: Is the item borrowed?
de: Ist der Gegenstand geliehen?

# lendingSwitchTitleBorrowed
source: Item borrowed
de: Gegenstand geliehen

# lendingSwitchTitleLent
source: Item lent
de: Gegenstand verliehen

# lendingTitleEdit
source: Edit lending
de: Ausleihe bearbeiten

# lendingTitleNew
source: New lending
de: Neue Ausleihe

# lendingsEmptyList
source: No lendings
de: Keine Ausleihen

# lendingsEmptyListFiltered
source: No lendings for these filters
de: Keine Ausleihen für diese Filter

# lendingsTitle
source: Lendings
de: Ausleihen

# messageCategoryCreateFailure
source: Could not create category.
de: Kategorie konnte nicht angelegt werden.

# messageCategoryCreateSuccess
source: Category successfully created.
de: Kategorie erfolgreich angelegt.

# messageCategoryDeleteFailure
source: Could not delete category.
de: Kategorie konnte nicht gelöscht werden.

# messageCategoryDeleteProhibited
source: Could not delete category. At least one item with this category still exist.
de: Kategorie konnte nicht gelöscht werden. Es existiert noch mindestens ein Gegenstand mit dieser Kategorie.

# messageCategoryDeleteSuccess
source: Category successfully deleted.
de: Kategorie erfolgreich gelöscht.

# messageCategoryUpdateFailure
source: Could not update category.
de: Kategorie konnte nicht geändert werden.

# messageCategoryUpdateSuccess
source: Category successfully updated.
de: Kategorie erfolgreich geändert.

# messageItemCreateFailure
source: Could not create item.
de: Gegenstand konnte nicht angelegt werden.

# messageItemCreateSuccess
source: Item successfully created.
de: Gegenstand erfolgreich angelegt.

# messageItemDeleteFailure
source: Could not delete item.
de: Gegenstand konnte nicht gelöscht werden.

# messageItemDeleteProhibited
source: Could not delete item. At least one lending with this item still exist.
de: Gegenstand konnte nicht gelöscht werden. Es existiert noch mindestens eine Ausleihe mit diesem Gegenstand.

# messageItemDeleteSuccess
source: Item successfully deleted.
de: Gegenstand erfolgreich angelegt.

# messageItemUpdateFailure
source: Could not update item.
de: Gegenstand konnte nicht geändert werden.

# messageItemUpdateSuccess
source: Item successfully updated.
de: Gegenstand erfolgreich geändert.

# messageLendingCreateFailure
source: Could not create lending.
de: Ausleihe konnte nicht angelegt werden.

# messageLendingCreateSuccess
source: Lending successfully created.
de: Ausleihe erfolgreich angelegt.

# messageLendingDeleteFailure
source: Could not delete lending.
de: Ausleihe konnte nicht gelöscht werden.

# messageLendingDeleteSuccess
source: Lending successfully deleted.
de: Ausleihe erfolgreich gelöscht.

# messageLendingReturnFailure
source: Could not return lending.
de: Ausleihe konnte nicht zurückgegeben werden.

# messageLendingReturnSuccess
source: Lending successfully returned.
de: Ausleihe erfolgreich zurückgegeben.

# messageLendingUpdateFailure
source: Could not update lending.
de: Ausleihe konnte nicht geändert werden.

# messageLendingUpdateSuccess
source: Lending successfully updated.
de: Ausleihe erfolgreich geändert.

# messagePersonCreateFailure
source: Could not create person.
de: Person konnte nicht angelegt werden.

# messagePersonCreateSuccess
source: Person successfully created.
de: Person erfolgreich angelegt.

# messagePersonDeleteFailure
source: Could not delete person.
de: Person konnte nicht gelöscht werden.

# messagePersonDeleteProhibited
source: Could not delete person. At least one lending with this person still exist.
de: Person konnte nicht gelöscht werden. Es existiert noch mindestens eine Ausleihe mit dieser Person.

# messagePersonDeleteSuccess
source: Person successfully deleted.
de: Person erfolgreich gelöscht.

# messagePersonUpdateFailure
source: Could not update person.
de: Person konnte nicht geändert werden.

# messagePersonUpdateSuccess
source: Person successfully updated.
de: Person erfolgreich geändert.

# peopleEmptyList
source: No people
de: Keine Kategorien

# peopleTitle
source: People
de: Personen

# personTitleEdit
source: Edit person
de: Person bearbeiten

# personTitleNew
source: New person
de: Neue Person

source: returned
de: zurückgegeben

source: Search category
de: Suche Kategorie

source: Search item
de: Suche Gegenstand

source: Search person
de: Suche Person

# settingsAppearanceLabel
source: Appearance
de: Aussehen

# settingsTitle
source: Settings
de: Einstellungen

# themeDark
source: Dark theme
de: Dunkles Thema

# themeLight
source: Light theme
de: Helles Thema

# themeSystem
source: System theme
de: Systemthema

# timeAgo
source: {difference,plural, =0{today} =1{yesterday} other{{difference} days ago}}
de: {difference,plural, =0{heute} =1{gestern} other{vor {difference} Tagen}}

source: Undo
de: Rückgängig
